NGC 5
Nisrina Tsany Sulthanah
RMT 38

```sql
CREATE TABLE Customers (
    customer_id SERIAL PRIMARY KEY,
    customer_name VARCHAR(70),
    city VARCHAR(50)
);

CREATE TABLE Orders (
    order_id SERIAL PRIMARY KEY,
    customer_id INT REFERENCES Customers(customer_id),
    order_date DATE,
    total_amount DECIMAL(10, 2)
);

INSERT INTO Customers (customer_id, customer_name, city) VALUES
(1, 'John Doe', 'New York'),
(2, 'Jane Smith', 'Los Angeles'),
(3, 'David Johnson', 'Chicago');

INSERT INTO Orders (order_id, customer_id, order_date, total_amount) VALUES
(1, 1, '2022-01-10', 100.00),
(2, 1, '2022-02-15', 150.00),
(3, 2, '2022-03-20', 200.00),
(4, 3, '2022-04-25', 50.00);

SELECT 
    c.customer_name,
    COUNT(o.order_id) total_orders
FROM 
    Customers c
LEFT JOIN 
    Orders o ON c.customer_id = o.customer_id
GROUP BY 
    c.customer_name;

```

![Alt text](output_ngc5_nisrina.png)